Ac6Embedded/svd-microchip/PIC32CX_BZ/WBZ451H.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>ADCHS</name>
         <version>025081.0</version>
         <description>12-bit Analog to Digital Converter</description>
         <baseAddress>0x44001400</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0xAB4</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>ADCHS</name>
            <description>Analog-to-Digital Converter</description>
            <value>23</value>
         </interrupt>
         <interrupt>
            <name>ADC_FAULT</name>
            <description>ADC Fault Interrupt</description>
            <value>34</value>
         </interrupt>
         <interrupt>
            <name>ADC_EOS</name>
            <description>ADC EOS Interrupt</description>
            <value>35</value>
         </interrupt>
         <interrupt>
            <name>ADC_BGVR_RDY</name>
            <description>ADC BGVR Ready</description>
            <value>36</value>
         </interrupt>
         <registers>
            <register>
               <name>ADCCON1</name>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DMABL</name>
                     <description>DMA to System RAM Buffer Length Size bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>DMABLSelect</name>
                        <enumeratedValue>
                           <name>128_DMABL</name>
                           <description>Allocates 128 locations in system memory to each analog input</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>64_DMABL</name>
                           <description>Allocates 64 locations in system memory to each analog input</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>32_DMABL</name>
                           <description>Allocates 32 locations in system memory to each analog input</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>16_DMABL</name>
                           <description>Allocates 16 locations in system memory to each analog input</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8_DMABL</name>
                           <description>Allocates 8 locations in system memory to each analog input</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4_DMABL</name>
                           <description>Allocates 4 locations in system memory to each analog input</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2_DMABL</name>
                           <description>Allocates 2 locations in system memory to each analog input</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1_DMABL</name>
                           <description>Allocates 1 location in system memory to each analog input</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>STRGLVL</name>
                     <description>Scan Trigger High Level/Positive Edge Sensitivity bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>STRGLVLSelect</name>
                        <enumeratedValue>
                           <name>SCTRIG_HIGH</name>
                           <description>Scan trigger is high level sensitive. Once STRIG mode is selected the scan trigger will continue for all selected analog inputs</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SCTRIG_POSEDGE</name>
                           <description>Scan trigger is positive edge sensitive. Once STRIG mode is selected only a single scan trigger will be generated which will complete the scan of all selected analog inputs. (TRGSRCx in the ADCTRGx register)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IRQVS</name>
                     <description>Interrupt Vector Shift bits</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>IRQVSSelect</name>
                        <enumeratedValue>
                           <name>SHL_7</name>
                           <description>Shift x left 7 bit position</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHL_6</name>
                           <description>Shift x left 6 bit position</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHL_5</name>
                           <description>Shift x left 5 bit position</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHL_4</name>
                           <description>Shift x left 4 bit position</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHL_3</name>
                           <description>Shift x left 3 bit position</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHL_2</name>
                           <description>Shift x left 2 bit position</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHL_1</name>
                           <description>Shift x left 1 bit position</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHL_0</name>
                           <description>Shift x left 0 bit position</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SCANEN</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSYUPB</name>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FSYDMA</name>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SIDL</name>
                     <description>Stop in Idle Mode bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SIDLSelect</name>
                        <enumeratedValue>
                           <name>DISCONTINUE</name>
                           <description>Discontinue module operation when device enters Idle mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CONTINUE</name>
                           <description>Continue module operation in Idle mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FRZ</name>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ON</name>
                     <description>ADC Module Enable bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ONSelect</name>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>ADC module is enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>ADC module is disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>STRGSRC</name>
                     <description>Scan Trigger Source Select bits</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                     <enumeratedValues>
                        <name>STRGSRCSelect</name>
                        <enumeratedValue>
                           <name>EXT_TRIG_VAL</name>
                           <description>External trigger for validation</description>
                           <value>0x1f</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_47</name>
                           <description>ADC_TRIG_16</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_46</name>
                           <description>ADC_TRIG_15</description>
                           <value>0xf</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_45</name>
                           <description>ADC_TRIG_14</description>
                           <value>0xe</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_44</name>
                           <description>ADC_TRIG_13</description>
                           <value>0xd</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_43</name>
                           <description>ADC_TRIG_12</description>
                           <value>0xc</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_42</name>
                           <description>ADC_TRIG_11</description>
                           <value>0xb</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_41</name>
                           <description>ADC_TRIG_10</description>
                           <value>0xa</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_40</name>
                           <description>ADC_TRIG_9</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_39</name>
                           <description>ADC_TRIG_8</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_38</name>
                           <description>ADC_TRIG_7</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_37</name>
                           <description>ADC_TRIG_6</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVSYS_36</name>
                           <description>ADC_TRIG_5</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INT0</name>
                           <description>INT0</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SW_LVL</name>
                           <description>Software level trigger</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SW_EDGE</name>
                           <description>Software edge trigger</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Trigger</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SELRES</name>
                     <description>Shared ADC7 Resolution bits</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SELRESSelect</name>
                        <enumeratedValue>
                           <name>12_BITS</name>
                           <description>12 bits (default)</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10_BITS</name>
                           <description>10 bits</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8_BITS</name>
                           <description>8 bits</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>6_BITS</name>
                           <description>6 bits</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FRACT</name>
                     <description>Fractional Data Output Format bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FRACTSelect</name>
                        <enumeratedValue>
                           <name>FRAC</name>
                           <description>Fractional</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INT</name>
                           <description>Integer</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
